app/controllers/applications_controller.rb

SELECT * FROM `applications`
---
  def index
    @applications = Application.all

SELECT * FROM `applications` WHERE (`applications`.`id` = 1)
---
  def show
    @application = Application.find(params[:id])

SELECT * FROM `applications` WHERE (`applications`.`id` = 1)
---
  def edit
    @application = Application.find(params[:id])

INSERT INTO `applications` (`created_at`, `title`, `updated_at`, `description`, `web_link`) VALUES('2010-05-04 20:46:15', 'Facebook\'s new iPhone app', '2010-05-04 20:46:15', 'abc def ghi jkl', 'www.itunes.com')
---
  def create
    @application = Application.new(params[:application])

    respond_to do |format|
      if @application.save

SELECT * FROM `applications` WHERE (`applications`.`id` = 1)
UPDATE `applications` SET `updated_at` = '2010-05-04 20:47:00', `web_link` = 'http://www.itunes.com' WHERE `id` = 1
---
  def update
    @application = Application.find(params[:id])

    respond_to do |format|
      if @application.update_attributes(params[:application])