app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT * FROM `blogs`

  def show
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)

  def create
    @blog = Blog.new(params[:blog])

    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`created_at`, `title`, `updated_at`, `publish_date`, `web_link`) VALUES('2010-05-04 20:31:34', 'Teens, Be Aware of Facebook’s New Privacy Settings', '2010-05-04 20:31:34', '2010-05-04', 'http://kristenicole2.wordpress.com/2009/12/16/teens-be-aware-of-facebooks-new-privacy-settings/')