app/controllers/books_controller.rb

SELECT * FROM `books`
---
  def index
    @books = Book.all

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 1)
---
  def edit
    @book = Book.find(params[:id])

INSERT INTO `books` (`created_at`, `title`, `updated_at`, `purchase_web_link`, `description`, `image_link`) VALUES('2010-05-01 06:45:33', 'b1', '2010-05-01 06:45:33', 'http://www.cnn.com', 'b1 desc', 'http://100interviews.files.wordpress.com/2009/03/kristen-nicole.png?w=294&h=479')
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT * FROM `books` WHERE (`books`.`id` = 1)
UPDATE `books` SET `updated_at` = '2010-05-03 18:46:58', `title` = 'Smashing WordPress: Beyond the Blog', `image_link` = 'http://www.borders.com/ProductImages/products/00/60/07/a/60076216_a.jpg', `description` = 'GO BEYOND THE BLOGSmashing WordPress shows you how to utilize the power of the WordPress platform, and provides a creative spark to help you build WordPress-powered sites that go beyond the obvious. You will learn the core concepts used to build just about anything in WordPress, resulting in fast deployments and greater design flexibility.Inside, WordPress expert Thord Daniel Hedengren takes you beyond the blog and shows you how WordPress can serve as a CMS, a photo gallery, an e-commerce site, and more.YOU WILL LEARN: THE ANATOMY OF A WP INSTALL AND HOW WORDPRESS ACTUALLY WORKS HOW TO BUILD BEAUTIFUL WORDPRESS THEMES - INCLUDING CHILD THEMES HOW TO CREATE CUSTOM LOGIN FORMS AND ADMIN THEMES HOW TO USE THE LOOP TO CONTROL CONTENT, AND EVEN USE ALTERNATIVES TO THE LOOP HOW TO INTEGRATE THEME OPTIONS HOW TO BUILD PLUGINS - INCLUDING WIDGET FUNCTIONALITY HOW TO BUILD YOUR WORDPRESS PROJECTS FOR SEO INTEGRATE WORDPRESS WITH THE SOCIAL WEB HOW TO CREATE AMAZING NAVIGATION HOW TO USE CONDITIONAL CONTROL ELEMENTS.', `purchase_web_link` = 'http://www.borders.com/online/store/TitleDetail?sku=0470684151' WHERE `id` = 1
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])

SELECT * FROM `books` WHERE (`books`.`id` = 2)
DELETE FROM `books` WHERE `id` = 2
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy