app/controllers/videos_controller.rb

SELECT * FROM `videos`
---
  def index
    @videos = Video.all

SELECT * FROM `videos` WHERE (`videos`.`id` = 1)
---
  def show
    @video = Video.find(params[:id])

SELECT * FROM `videos` WHERE (`videos`.`id` = 1)
---
  def edit
    @video = Video.find(params[:id])

INSERT INTO `videos` (`created_at`, `title`, `updated_at`, `publish_date`, `web_link`) VALUES('2010-05-04 19:47:13', 'My first video', '2010-05-04 19:47:13', '2010-05-04', 'http://www.youtube.com/watch?v=6gvtc4zO47Q')
---
  def create
    @video = Video.new(params[:video])

    respond_to do |format|
      if @video.save

SELECT * FROM `videos` WHERE (`videos`.`id` = 1)
UPDATE `videos` SET `updated_at` = '2010-05-04 20:03:42', `web_link` = 'http://www.youtube.com/watch?v=iuSz10c_sxo' WHERE `id` = 1
---
  def update
    @video = Video.find(params[:id])

    respond_to do |format|
      if @video.update_attributes(params[:video])

SELECT * FROM `videos` WHERE (`videos`.`id` = 1)
DELETE FROM `videos` WHERE `id` = 1
---
  def destroy
    @video = Video.find(params[:id])
    @video.destroy